zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SCG.h
#define SCG_APLLCSR_APLLCMRE_MASK                (0x20000U)
#define SCG_APLLCSR_APLLCMRE_SHIFT               (17U)
/*! APLLCMRE - APLL Clock Monitor Reset Enable
 *  0b0..Clock monitor generates an interrupt when an error is detected
 *  0b1..Clock monitor generates a reset when an error is detected
 */
#define SCG_APLLCSR_APLLCMRE(x)                  (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_APLLCMRE_SHIFT)) & SCG_APLLCSR_APLLCMRE_MASK)

#define SCG_APLLCSR_LK_MASK                      (0x800000U)
#define SCG_APLLCSR_LK_SHIFT                     (23U)
/*! LK - Lock Register
 *  0b0..Control Status Register can be written
 *  0b1..Control Status Register cannot be written
 */
#define SCG_APLLCSR_LK(x)                        (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_LK_SHIFT)) & SCG_APLLCSR_LK_MASK)

#define SCG_APLLCSR_APLL_LOCK_MASK               (0x1000000U)
#define SCG_APLLCSR_APLL_LOCK_SHIFT              (24U)
/*! APLL_LOCK - APLL LOCK
 *  0b0..APLL is not powered on or not locked
 *  0b1..APLL is locked
 */
#define SCG_APLLCSR_APLL_LOCK(x)                 (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_APLL_LOCK_SHIFT)) & SCG_APLLCSR_APLL_LOCK_MASK)

#define SCG_APLLCSR_APLLSEL_MASK                 (0x2000000U)
#define SCG_APLLCSR_APLLSEL_SHIFT                (25U)
/*! APLLSEL - APLL Selected
 *  0b0..APLL is not the system clock source
 *  0b1..APLL is the system clock source
 */
#define SCG_APLLCSR_APLLSEL(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_APLLSEL_SHIFT)) & SCG_APLLCSR_APLLSEL_MASK)

#define SCG_APLLCSR_APLLERR_MASK                 (0x4000000U)
#define SCG_APLLCSR_APLLERR_SHIFT                (26U)
/*! APLLERR - APLL Clock Error
 *  0b0..APLL Clock Monitor is disabled or has not detected an error
 *  0b1..APLL Clock Monitor is enabled and detected an error
 */
#define SCG_APLLCSR_APLLERR(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_APLLERR_SHIFT)) & SCG_APLLCSR_APLLERR_MASK)

#define SCG_APLLCSR_APLL_LOCK_IE_MASK            (0x40000000U)
#define SCG_APLLCSR_APLL_LOCK_IE_SHIFT           (30U)
/*! APLL_LOCK_IE - APLL LOCK Interrupt Enable
 *  0b0..APLL_LOCK interrupt is not enabled
 *  0b1..APLL_LOCK interrupt is enabled
 */
#define SCG_APLLCSR_APLL_LOCK_IE(x)              (((uint32_t)(((uint32_t)(x)) << SCG_APLLCSR_APLL_LOCK_IE_SHIFT)) & SCG_APLLCSR_APLL_LOCK_IE_MASK)
/*! @} */

/*! @name APLLCTRL - APLL Control Register */
/*! @{ */

#define SCG_APLLCTRL_SELR_MASK                   (0xFU)
#define SCG_APLLCTRL_SELR_SHIFT                  (0U)
/*! SELR - Bandwidth select R (resistor) value. */
#define SCG_APLLCTRL_SELR(x)                     (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_SELR_SHIFT)) & SCG_APLLCTRL_SELR_MASK)

#define SCG_APLLCTRL_SELI_MASK                   (0x3F0U)
#define SCG_APLLCTRL_SELI_SHIFT                  (4U)
/*! SELI - Bandwidth select I (integration) value. */
#define SCG_APLLCTRL_SELI(x)                     (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_SELI_SHIFT)) & SCG_APLLCTRL_SELI_MASK)

#define SCG_APLLCTRL_SELP_MASK                   (0x7C00U)
#define SCG_APLLCTRL_SELP_SHIFT                  (10U)
/*! SELP - Bandwidth select P (proportional) value. */
#define SCG_APLLCTRL_SELP(x)                     (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_SELP_SHIFT)) & SCG_APLLCTRL_SELP_MASK)

#define SCG_APLLCTRL_BYPASSPOSTDIV2_MASK         (0x10000U)
#define SCG_APLLCTRL_BYPASSPOSTDIV2_SHIFT        (16U)
/*! BYPASSPOSTDIV2 - Bypass of Divide-by-2 Divider
 *  0b0..Use the divide-by-2 divider in the postdivider
 *  0b1..Bypass of the divide-by-2 divider in the postdivider
 */
#define SCG_APLLCTRL_BYPASSPOSTDIV2(x)           (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_BYPASSPOSTDIV2_SHIFT)) & SCG_APLLCTRL_BYPASSPOSTDIV2_MASK)

#define SCG_APLLCTRL_LIMUPOFF_MASK               (0x20000U)
#define SCG_APLLCTRL_LIMUPOFF_SHIFT              (17U)
/*! LIMUPOFF - Up Limiter
 *  0b0..Application set to non-Spectrum and Fractional applications.
 *  0b1..Application set to Spectrum and Fractional applications.
 */
#define SCG_APLLCTRL_LIMUPOFF(x)                 (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_LIMUPOFF_SHIFT)) & SCG_APLLCTRL_LIMUPOFF_MASK)

#define SCG_APLLCTRL_BANDDIRECT_MASK             (0x40000U)
#define SCG_APLLCTRL_BANDDIRECT_SHIFT            (18U)
/*! BANDDIRECT - Control of the bandwidth of the PLL.
 *  0b0..The bandwidth is changed synchronously with the feedback-divider
 *  0b1..Modifies the bandwidth of the PLL directly
 */
#define SCG_APLLCTRL_BANDDIRECT(x)               (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_BANDDIRECT_SHIFT)) & SCG_APLLCTRL_BANDDIRECT_MASK)

#define SCG_APLLCTRL_BYPASSPREDIV_MASK           (0x80000U)
#define SCG_APLLCTRL_BYPASSPREDIV_SHIFT          (19U)
/*! BYPASSPREDIV - Bypass of the predivider
 *  0b0..Use the predivider.
 *  0b1..Bypass of the predivider.
 */
#define SCG_APLLCTRL_BYPASSPREDIV(x)             (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_BYPASSPREDIV_SHIFT)) & SCG_APLLCTRL_BYPASSPREDIV_MASK)

#define SCG_APLLCTRL_BYPASSPOSTDIV_MASK          (0x100000U)
#define SCG_APLLCTRL_BYPASSPOSTDIV_SHIFT         (20U)
/*! BYPASSPOSTDIV - Bypass of the postdivider
 *  0b0..Use the postdivider.
 *  0b1..Bypass of the postdivider
 */
#define SCG_APLLCTRL_BYPASSPOSTDIV(x)            (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_BYPASSPOSTDIV_SHIFT)) & SCG_APLLCTRL_BYPASSPOSTDIV_MASK)

#define SCG_APLLCTRL_FRM_MASK                    (0x400000U)
#define SCG_APLLCTRL_FRM_SHIFT                   (22U)
/*! FRM - Free Running Mode Enable
 *  0b0..Free running mode disabled
 *  0b1..Free running mode enabled
 */
#define SCG_APLLCTRL_FRM(x)                      (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_FRM_SHIFT)) & SCG_APLLCTRL_FRM_MASK)

#define SCG_APLLCTRL_SOURCE_MASK                 (0x6000000U)
#define SCG_APLLCTRL_SOURCE_SHIFT                (25U)
/*! SOURCE - Clock Source
 *  0b00..SOSC
 *  0b01..FIRC 48 MHz clock. FIRC_SCLK_PERIPH_EN must be set to use FIRC 48 MHz clock.
 *  0b10..Reserved
 *  0b11..No clock
 */
#define SCG_APLLCTRL_SOURCE(x)                   (((uint32_t)(((uint32_t)(x)) << SCG_APLLCTRL_SOURCE_SHIFT)) & SCG_APLLCTRL_SOURCE_MASK)
/*! @} */

/*! @name APLLSTAT - APLL Status Register */
/*! @{ */

#define SCG_APLLSTAT_NDIVACK_MASK                (0x2U)
#define SCG_APLLSTAT_NDIVACK_SHIFT               (1U)
/*! NDIVACK - Predivider(N) ratio change acknowledge.
 *  0b0..The predivider (N) ratio change is not accepted by the analog PLL
 *  0b1..The predivider (N) ratio change is accepted by the analog PLL
 */
#define SCG_APLLSTAT_NDIVACK(x)                  (((uint32_t)(((uint32_t)(x)) << SCG_APLLSTAT_NDIVACK_SHIFT)) & SCG_APLLSTAT_NDIVACK_MASK)

#define SCG_APLLSTAT_MDIVACK_MASK                (0x4U)
#define SCG_APLLSTAT_MDIVACK_SHIFT               (2U)
/*! MDIVACK - Feedback(M) divider ratio change acknowledge.
 *  0b0..The feedback (M) ratio change is not accepted by the analog PLL
 *  0b1..The feedback (M) ratio change is accepted by the analog PLL
 */
#define SCG_APLLSTAT_MDIVACK(x)                  (((uint32_t)(((uint32_t)(x)) << SCG_APLLSTAT_MDIVACK_SHIFT)) & SCG_APLLSTAT_MDIVACK_MASK)

#define SCG_APLLSTAT_PDIVACK_MASK                (0x8U)
#define SCG_APLLSTAT_PDIVACK_SHIFT               (3U)
/*! PDIVACK - Postdivider(P) ratio change acknowledge.
 *  0b0..The postdivider (P) ratio change is not accepted by the analog PLL
 *  0b1..The postdivider (P) ratio change is accepted by the analog PLL
 */
#define SCG_APLLSTAT_PDIVACK(x)                  (((uint32_t)(((uint32_t)(x)) << SCG_APLLSTAT_PDIVACK_SHIFT)) & SCG_APLLSTAT_PDIVACK_MASK)

